/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   mess_err.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: pcorlys- <pcorlys-@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/08/06 17:16:30 by pcorlys-          #+#    #+#             */
/*   Updated: 2019/09/07 20:06:45 by pcorlys-         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/fractal.h"

void	mess_err(int a)
{
	if (a == 0)
		ft_printf("Не выделена память. Чекай маллок\n");
	if (a == 1)
		ft_printf("Не указан или неправильно написан вызваемый фрактал.\n"
"./fractol Mandelbrot - множество Мальдеброта\n"
"./fractol Julia - множество Жулиа\n"
"./fractol Mandelbar - множество Мандельбара\n");
	exit(0);
}
